Revit 2027 API
MEPCurve.MEPSystem Property
The system of the MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystem MEPSystem { get; }
Public ReadOnly Property MEPSystem As MEPSystem
	Get
public:
property MEPSystem^ MEPSystem {
	MEPSystem^ get ();
}
member MEPSystem : MEPSystem with get
Property Value
MEPSystem
Remarks
Returns the system of this MEP curve. If the curve does not belong to any systems, the value will be null. If the curve belongs to more than one system, the first available value is returned.
See Also
Reference
MEPCurve Class
Autodesk.Revit.DB Namespace